test/request-response-samples/GetNodes__complex_self_referencing/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://tempuri.org/"><soap:Header></soap:Header><soap:Body><tns:GetNodes xmlns:tns="http://tempuri.org/" xmlns="http://tempuri.org/"></tns:GetNodes></soap:Body></soap:Envelope>